{
    "account": {
        "client_id": "",
        "client_secret": "",
        "username": "",
        "password": "",
        "user_agent": "epic-user-agent"
    },
    "KarmaWhore": {
        "name": "Callusedthenics",
        "message": "I know what you're thinking: \"Why do I need a post about this guy when he spams this subreddit everyday?\" Well this is a different kind of post. I know it may be long but bear with me and I will show you the truth about Joshua \"the motivation man\" Savanh - an overweight 26 year old pilipino who has no job and lives with his parents. \n\nAfter dropping out of the army because he realized that it was too hard and there are only 3 meals per day which are portioned, he decided to come back to mom and dad and eat himself to 325lbs.Then he decided to lose the weight, but he didn't want to get a job ( or couldn't ) and started a YT channel so he can get money from there while doing push ups from his parents' basement and so he started posting his \"Fitness Journey\".\n\nUpon realizing that nobody is watching he decided to buy a reddit account with 100K positive karma to promote it, spam every fitness subreddit everyday and make 10 other reddit accounts so he can upvote and comment as other people to create \"hype\", deceiving others into thinking he's more popular than he actually is. Some of us noticed immediately but that didn't stop him at all.Here's a list of all of his alternate accounts:\n\nu/Calusedthenics, u/Motivation-Man , u/Flame_Flower, u/inspire_and_motivate, u/conquer_your_mind, u/dragonsdoexist, u/belly_food, u/shadowboxing_club, u/aclrksn9, u/alex210saa, u/BuckLoudKnee920, u/Preskata6 Yes, he made an account with almost the same name as me after I commented what a fraud he is constantly ( the last one on the list)\n\nLook out for these in the comments bellow because they'll will appear defending him - it's all him switching accounts in desperation. You don't need to be a brain surgeon to figure it out, he's not that smart to begin with.\n\nBut yesterday after his usual 7 course post work out meal he posted this out of his 2nd main account: https://www.reddit.com/r/Shower/comments/fb1qoy/showering_and_forgot_my_soap/fj1r10m/?context=3This is the link to the post and this is the picture which he deleted immediately after realizing how much he fucked up: https://imgur.com/0nFmSLg [ NSFW ]\n\nAnd before you ask - YES. Joshua SHAT in the shower, STEPPED on it and decided to TAKE A PHOTO and UPLOAD IT reddit.\n\nAnd this is why I decided to make this post. I don't want any karma, it's to warn YOU and tell you that NO MATTER how out of shape you are, no matter how unmottivated you feel, YOU are 100 times better than the person who SHITS in the SHOWER and POSTS it to Reddit and you will never need ANY of his advice or cliche motivational posts to reach your GOALS.And in the end he isn't doing it for anyone but himself and his selfish reasons. I KNOW YOU DESERVE BETTER ! \n\n[original](https://www.reddit.com/r/FitLifeVideos/comments/fbgc12/exposing_post_about_motivation_man/fj43g05)"
    }
}